{"module": "keras", "class_name": "Sequential", "config": {"name": "sequential_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 59], "dtype": "float32", "sparse": false, "name": "input_layer"}, "registered_name": null}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "embedding", "trainable": false, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "input_dim": 253, "output_dim": 100, "embeddings_initializer": {"module": "keras.initializers", "class_name": "Constant", "config": {"value": {"class_name": "__numpy__", "config": {"value": [[0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.03819400072097778, -0.24487000703811646, 0.7281200289726257, -0.3996100127696991, 0.08317200094461441, 0.043953001499176025, -0.3914099931716919, 0.3343999981880188, -0.5754500031471252, 0.08745899796485901, 0.28786998987197876, -0.06730999797582626, 0.3090600073337555, -0.263839989900589, -0.13231000304222107, -0.20757000148296356, 0.333950012922287, -0.33847999572753906, -0.3174299895763397, -0.4833599925041199, 0.14640000462532043, -0.37303999066352844, 0.345770001411438, 0.05204100161790848, 0.4494599997997284, -0.46970999240875244, 0.026280000805854797, -0.5415499806404114, -0.15518000721931458, -0.14106999337673187, -0.03972199931740761, 0.2827700078487396, 0.14393000304698944, 0.2346400022506714, -0.3102099895477295, 0.08617299795150757, 0.20397000014781952, 0.5262399911880493, 0.17163999378681183, -0.08237800002098083, -0.7178699970245361, -0.41530999541282654, 0.2033499926328659, -0.12762999534606934, 0.41367000341415405, 0.5518699884414673, 0.5790799856185913, -0.33476999402046204, -0.36559000611305237, -0.5485699772834778, -0.06289199739694595, 0.26583999395370483, 0.30204999446868896, 0.9977499842643738, -0.8048099875450134, -3.0243000984191895, 0.012539999559521675, -0.36941999197006226, 2.2167000770568848, 0.7220100164413452, -0.24977999925613403, 0.9213600158691406, 0.03451399877667427, 0.46744999289512634, 1.1079000234603882, -0.1935800015926361, -0.07457499951124191, 0.23352999985218048, -0.05206200107932091, -0.22044000029563904, 0.057162001729011536, -0.1580599993467331, -0.3079800009727478, -0.41624999046325684, 0.379720002412796, 0.1500599980354309, -0.5321199893951416, -0.20550000667572021, -1.2525999546051025, 0.07162400335073471, 0.7056499719619751, 0.49744001030921936, -0.42063000798225403, 0.2614800035953522, -1.5379999876022339, -0.30223000049591064, -0.07343800365924835, -0.2831200063228607, 0.3710399866104126, -0.25216999650001526, 0.016215000301599503, -0.01709900051355362, -0.3898400068283081, 0.874239981174469, -0.7256900072097778, -0.5105800032615662, -0.5202800035476685, -0.14589999616146088, 0.8277999758720398, 0.2706199884414673], [-0.5718399882316589, 0.046348001807928085, 0.8673200011253357, -0.5903499722480774, -0.6493200063705444, 0.6588000059127808, -0.8278999924659729, 0.22565999627113342, -0.019818000495433807, 0.2121800035238266, 0.3752700090408325, 0.17482000589370728, 0.2858799993991852, 0.22922000288963318, -0.10478000342845917, -0.36858001351356506, -0.09760499745607376, 0.5298900008201599, -0.023984000086784363, 0.41082000732421875, -0.680679976940155, -0.11251000314950943, -0.3501499891281128, -0.29451000690460205, 0.38231000304222107, 0.9397600293159485, -0.736299991607666, -1.01419997215271, 0.6060699820518494, -0.4646399915218353, 0.8398399949073792, 1.2551000118255615, 0.499889999628067, 0.041839998215436935, -0.3124600052833557, 0.3882499933242798, -0.66211998462677, 0.0026328000240027905, 0.625190019607544, -0.7409999966621399, 0.5718500018119812, -0.3599199950695038, 0.21821999549865723, -0.7800700068473816, -0.7754799723625183, 0.1330299973487854, -0.9259700179100037, -0.32256999611854553, -0.025227999314665794, -1.3961000442504883, 0.22933000326156616, 0.2695100009441376, -0.16118000447750092, 0.8521400094032288, -0.0785679966211319, -2.285900115966797, 0.8718600273132324, 0.296970009803772, 2.380000114440918, -0.19922000169754028, 0.5503900051116943, 1.6426000595092773, -0.31060001254081726, -0.029347000643610954, 0.9393500089645386, 0.5701799988746643, 0.5862100124359131, -0.25936999917030334, 0.3896600008010864, -0.5606200098991394, 0.09914799779653549, 0.46786001324653625, 0.5448200106620789, -0.9599300026893616, 0.6297299861907959, 0.4391399919986725, -0.2858099937438965, -0.48357000946998596, -0.415149986743927, 0.1803400069475174, 0.4331800043582916, 0.5131000280380249, -0.37042999267578125, -0.1584700047969818, -1.5992000102996826, -0.21375000476837158, -0.14180000126361847, -0.1423099935054779, -0.12466000020503998, -0.05291200056672096, -0.6273599863052368, 0.8597599864006042, 1.2702000141143799, 0.045308999717235565, -0.544700026512146, -0.5543000102043152, 0.25635001063346863, -0.3566499948501587, 0.9292500019073486, 0.8995299935340881], [-0.1273999959230423, 0.13500000536441803, 0.30867999792099, 0.6017100214958191, -0.3444800078868866, -0.15686999261379242, -0.7928299903869629, 0.3054499924182892, 0.09776800125837326, -0.33138999342918396, -0.44220998883247375, -0.09812600165605545, -0.10751999914646149, -0.34692999720573425, -0.33924999833106995, -0.46090999245643616, -0.0963210016489029, 0.2560499906539917, -0.3430899977684021, 0.4031600058078766, -0.2278199940919876, -0.2143000066280365, -0.1727599948644638, -0.3121500015258789, -0.439300000667572, 0.06688699871301651, -0.11632999777793884, -0.5735300183296204, 0.04543500021100044, 0.20958000421524048, -0.004201400093734264, 0.25745999813079834, -0.4609900116920471, -0.26969000697135925, 0.29778000712394714, 0.01856200024485588, 0.15828999876976013, -0.3521299958229065, -0.1730699986219406, -0.45061999559402466, -0.7823699712753296, 0.18937000632286072, 0.6783999800682068, -0.5287799835205078, -0.43108999729156494, -0.14756999909877777, 0.13098999857902527, -0.22330999374389648, -0.7111300230026245, -1.1266000270843506, 0.794700026512146, -0.06082800030708313, -0.034942999482154846, 0.7361800074577332, -0.8542500138282776, -1.5793999433517456, 0.6239100098609924, -0.5048800110816956, 1.5537999868392944, 0.21310999989509583, -0.4473100006580353, 0.29580000042915344, -0.033066000789403915, -0.247979998588562, 1.1643999814987183, -0.02006099931895733, 0.20239000022411346, 1.006700038909912, -0.6006799936294556, -0.21604999899864197, -0.11924000084400177, -0.506309986114502, -0.601830005645752, -0.41067999601364136, -0.5060200095176697, -0.09213200211524963, -0.1748100072145462, -0.12053000181913376, -0.34685999155044556, -0.20235000550746918, 0.08997099846601486, -0.4184400141239166, -0.5186899900436401, -0.12442000210285187, -1.107300043106079, -0.08526600152254105, 0.161080002784729, 0.08297000080347061, -0.40573999285697937, -0.4578700065612793, -0.0872649997472763, -0.16362999379634857, -0.35332998633384705, -0.6516100168228149, -0.5749899744987488, -0.005317599978297949, -0.1994200050830841, -0.28665998578071594, 0.6629599928855896, 0.20317000150680542], [0.371069997549057, 0.17847999930381775, 0.6100900173187256, 0.07107599824666977, 0.16229000687599182, -1.0312000513076782, -0.35517001152038574, -0.826990008354187, 0.0301900003105402, -0.0464010015130043, -0.4285300076007843, 0.17824000120162964, -0.29177001118659973, -0.408270001411438, 0.2446500062942505, -0.5050299763679504, -0.23215000331401825, 0.3913399875164032, 0.14097000658512115, 0.11218000203371048, -0.43612000346183777, -0.6922100186347961, -0.2983100116252899, 0.0266720000654459, -0.419979989528656, 0.12690000236034393, 0.4568600058555603, 0.25595998764038086, -0.2630099952220917, -0.15625999867916107, 0.006173999980092049, 0.06544899940490723, 0.08360700309276581, 0.044151999056339264, 0.5623000264167786, -0.5197200179100037, -0.16617000102996826, -0.11700999736785889, -0.4624499976634979, 0.4501200020313263, -0.6980699896812439, -0.23672999441623688, 0.20534999668598175, -0.5586100220680237, 0.7703400254249573, 0.3424299955368042, 0.15456999838352203, -0.06474299728870392, -1.0465999841690063, -0.11183000355958939, 0.05595200136303902, -0.47400999069213867, -0.2018200010061264, 0.9193000197410583, 0.477620005607605, -1.916200041770935, 0.1980700045824051, -0.8260200023651123, 1.6370999813079834, 0.35012000799179077, -0.7575700283050537, 0.8924099802970886, -0.36169999837875366, 0.546180009841919, 1.389799952507019, -0.04626699909567833, 0.6824899911880493, -0.15636000037193298, 0.4822399914264679, -0.2009900063276291, 0.1404999941587448, -0.24932999908924103, -0.4849199950695038, -0.5205399990081787, 0.12791000306606293, -0.416130006313324, 0.4378100037574768, -0.7504299879074097, -0.6910600066184998, 0.6172400116920471, 1.1502000093460083, -0.20013000071048737, -0.17880000174045563, -0.24798999726772308, -1.7192000150680542, -0.5983999967575073, 0.05425399914383888, 0.333730012178421, -0.2945300042629242, -0.9167299866676331, -0.657729983329773, 0.6376399993896484, 0.16514000296592712, -0.6581000089645386, -0.30654001235961914, 0.12137000262737274, 0.03558199852705002, 0.015576000325381756, 0.8686699867248535, 0.32833999395370483], [0.08570300042629242, -0.22201000154018402, 0.16569000482559204, 0.1337299942970276, 0.38238999247550964, 0.3540099859237671, 0.01286999974399805, 0.22461000084877014, -0.4381699860095978, 0.5016400218009949, -0.3587400019168854, -0.3498300015926361, 0.05515599995851517, 0.6964799761772156, -0.17958000302314758, 0.06792599707841873, 0.39100998640060425, 0.1603900045156479, -0.26635000109672546, -0.2113800048828125, 0.5369799733161926, 0.49379000067710876, 0.9366000294685364, 0.6690199971199036, 0.21793000400066376, -0.4664199948310852, 0.22382999956607819, -0.3620400130748749, -0.17655999958515167, 0.17479999363422394, -0.20366999506950378, 0.13931000232696533, 0.019832000136375427, -0.10412999987602234, -0.20243999361991882, 0.550029993057251, -0.15459999442100525, 0.986549973487854, -0.2686299979686737, -0.29089999198913574, -0.3286600112915039, -0.3418799936771393, -0.16943000257015228, -0.4200100004673004, -0.046727001667022705, -0.1632699966430664, 0.7082399725914001, -0.7491099834442139, -0.09155900031328201, -0.9617800116539001, -0.19746999442577362, 0.1028200015425682, 0.5522099733352661, 1.381600022315979, -0.6563599705696106, -3.250200033187866, -0.3155600130558014, -1.2055000066757202, 1.770900011062622, 0.4025999903678894, -0.7982699871063232, 1.1597000360488892, -0.33041998744010925, 0.3138200044631958, 0.773859977722168, 0.22595000267028809, 0.5247099995613098, -0.034053001552820206, 0.32047998905181885, 0.07994800060987473, 0.1775200068950653, -0.4942600131034851, -0.7004500031471252, -0.44569000601768494, 0.17244000732898712, 0.20277999341487885, 0.023291999474167824, -0.20677000284194946, -1.0157999992370605, 0.18324999511241913, 0.567520022392273, 0.31821000576019287, -0.6501100063323975, 0.6827700138092041, -0.8658499717712402, -0.05939200147986412, -0.29264000058174133, -0.5566800236701965, -0.3470500111579895, -0.3289499878883362, 0.4021500051021576, -0.12746000289916992, -0.20227999985218048, 0.8736799955368042, -0.5450000166893005, 0.7920500040054321, -0.20694999396800995, -0.0742729976773262, 0.758080005645752, -0.3424299955368042], [0.3316099941730499, 0.5742899775505066, -0.11439000070095062, -0.2272700071334839, 0.9671900272369385, -1.1770000457763672, 0.1898999959230423, 0.8020700216293335, 0.21250000596046448, 0.6480500102043152, 0.3488500118255615, 0.458730012178421, -0.028602000325918198, -0.7741600275039673, -0.4310699999332428, -0.8109099864959717, 0.7331200242042542, 0.44130998849868774, 0.027814000844955444, 0.44578999280929565, -0.6744099855422974, -0.3130800127983093, -0.37057000398635864, 0.13178999722003937, 0.007059100084006786, -0.02793099917471409, -0.0055113001726567745, 0.3459700047969818, -0.3442400097846985, -0.07484100013971329, -1.079699993133545, 0.7912999987602234, 0.3544999957084656, 0.8768799901008606, -0.21897000074386597, -0.060586001724004745, 0.07600700110197067, 0.15396000444889069, 0.23507000505924225, -0.14823000133037567, -0.2740800082683563, -0.018648000434041023, -0.2619200050830841, 0.3063099980354309, 0.3578599989414215, -0.3006100058555603, -0.1847199946641922, -0.03713800013065338, -0.4318599998950958, 0.22245000302791595, -0.2473900020122528, 0.06356599926948547, 0.4185999929904938, 0.9961400032043457, -0.17237000167369843, -2.5566000938415527, -0.37843000888824463, -0.4562300145626068, 1.6692999601364136, 0.06299299746751785, 0.028704000636935234, 0.6056200265884399, 0.14810000360012054, -0.04816500097513199, 1.1291999816894531, 0.3607800006866455, -0.08951099961996078, 0.5965700149536133, 0.32155001163482666, -0.5153200030326843, 0.7404699921607971, 0.2290399968624115, -0.5908300280570984, -0.2570599913597107, -0.2530199885368347, -0.4489400088787079, 0.3229599893093109, 0.8072100281715393, -1.062600016593933, 0.18704000115394592, 0.2556900084018707, 0.43900999426841736, -0.05815799906849861, 0.05445700138807297, -1.4793000221252441, 1.0054999589920044, 0.14031000435352325, -0.6381999850273132, -0.16103999316692352, -0.13875000178813934, 0.15995000302791595, -0.4762299954891205, -0.479310005903244, -0.02891100011765957, 0.414139986038208, 0.5208100080490112, -0.2523300051689148, -0.3174799978733063, 0.6778900027275085, -0.1318099945783615], [-0.21863000094890594, -0.42664000391960144, 0.519599974155426, 0.00431030010804534, 0.5804499983787537, -0.1087300032377243, -0.3772599995136261, 0.45660001039505005, -0.6062700152397156, -0.07577300071716309, 0.11305999755859375, 0.17702999711036682, 0.16050000488758087, 0.0745140016078949, 0.636489987373352, -0.07885199785232544, 0.7526800036430359, -0.2496200054883957, -0.5162799954414368, -0.33348000049591064, 0.6675400137901306, -0.34182998538017273, 0.6131600141525269, 0.31668001413345337, 0.6484599709510803, -0.07931199669837952, -0.06521899998188019, -0.17718000710010529, -0.3243899941444397, 0.5186799764633179, -0.23423999547958374, 0.34380999207496643, 0.04685100167989731, 0.7402499914169312, -0.47005000710487366, 0.5368499755859375, -0.3554899990558624, 0.407370001077652, -0.09342099726200104, -0.1343899965286255, -0.41969001293182373, -0.3004100024700165, 0.2864600121974945, 0.37419000267982483, -0.4605399966239929, -0.3070000112056732, -0.38580000400543213, -0.6931700110435486, -0.0009246100089512765, -0.6198400259017944, 0.11977999657392502, 0.14949999749660492, 0.17833000421524048, 1.5312999486923218, -0.9244499802589417, -3.042799949645996, 0.030760999768972397, -0.643589973449707, 2.3824000358581543, 0.5621899962425232, -0.5602099895477295, 1.0263999700546265, -0.45142999291419983, 0.14116999506950378, 0.6594399809837341, 0.37571999430656433, 0.09833399951457977, 0.38304001092910767, -0.07688199728727341, -0.2178100049495697, -0.29892000555992126, -0.4945800006389618, 0.09523899853229523, -0.63059002161026, -0.06131099909543991, 0.17767000198364258, -0.14050999283790588, 0.47181999683380127, -0.9589099884033203, 0.04533400014042854, 0.8080000281333923, -0.02686700038611889, -0.27483001351356506, 0.35541000962257385, -0.8289600014686584, -0.7883800268173218, -0.0797320008277893, 0.22940999269485474, -0.45012998580932617, -0.3003999888896942, -0.5271599888801575, 0.11358000338077545, -0.4990600049495697, 0.8270000219345093, -0.5699099898338318, 0.2514300048351288, -0.4026600122451782, -0.2914600074291229, 1.381600022315979, 0.18084000051021576], [0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0], [-0.15289999544620514, -0.24278999865055084, 0.8983700275421143, 0.16996000707149506, 0.5351600050926208, 0.4878399968147278, -0.5882599949836731, -0.1798200011253357, -1.3581000566482544, 0.4254100024700165, 0.15376999974250793, 0.24214999377727509, 0.13473999500274658, 0.41192999482154846, 0.6704300045967102, -0.5641800165176392, 0.4298500120639801, -0.012183000333607197, -0.11676999926567078, 0.3178099989891052, 0.05417700111865997, -0.05427300184965134, 0.3551599979400635, -0.3024100065231323, 0.3143399953842163, -0.3384599983692169, 0.7171499729156494, -0.26855000853538513, -0.1583700031042099, -0.4746699929237366, 0.0515809990465641, -0.3325200080871582, 0.1500300019979477, -0.1298999935388565, -0.5461699962615967, -0.37843000888824463, 0.6426100134849548, 0.8218700289726257, -0.08000600337982178, 0.07847899943590164, -0.969760000705719, -0.5774099826812744, 0.5649099946022034, -0.39873000979423523, -0.05709899961948395, 0.19742999970912933, 0.06570599973201752, -0.4809199869632721, -0.20125000178813934, -0.4083400070667267, 0.3945600092411041, -0.026419999077916145, -0.11838000267744064, 1.0119999647140503, -0.5317100286483765, -2.7474000453948975, -0.04298099875450134, -0.7484899759292603, 1.7574000358581543, 0.5908499956130981, 0.04884999990463257, 0.7826700210571289, 0.3849700093269348, 0.42096999287605286, 0.678820013999939, 0.10337000340223312, 0.6327999830245972, -0.02659500017762184, 0.5864700078964233, -0.44332000613212585, 0.3305700123310089, -0.12021999806165695, -0.5564500093460083, 0.07361099869012833, 0.20915000140666962, 0.4339500069618225, -0.012760999612510204, 0.08987399935722351, -1.7991000413894653, 0.08480799943208694, 0.771120011806488, 0.6310499906539917, -0.9068499803543091, 0.6032599806785583, -1.7515000104904175, 0.18595999479293823, -0.5068699717521667, -0.7020300030708313, 0.6657800078392029, -0.813040018081665, 0.1871200054883957, -0.018487999215722084, -0.26756998896598816, 0.7269999980926514, -0.5936300158500671, -0.34839001297950745, -0.5609400272369385, -0.5910000205039978, 1.0039000511169434, 0.20664000511169434], [-0.1440100073814392, 0.3255400061607361, 0.14257000386714935, -0.09922699630260468, 0.7253599762916565, 0.19321000576019287, -0.24187999963760376, 0.20223000645637512, -0.8959900140762329, 0.1521500051021576, 0.03596299886703491, -0.5951300263404846, -0.051635000854730606, -0.014427999965846539, 0.35475000739097595, -0.318589985370636, 0.7698400020599365, -0.08736900240182877, -0.24762000143527985, 0.6505900025367737, -0.1513800024986267, -0.4270299971103668, 0.18813000619411469, 0.09156200289726257, 0.15192000567913055, 0.11303000152111053, -0.1522199958562851, -0.6278600096702576, -0.23923000693321228, 0.09600900113582611, -0.46147000789642334, 0.41525998711586, -0.304749995470047, 0.1370999962091446, 0.1675799936056137, 0.5330100059509277, -0.043657999485731125, 0.8592399954795837, -0.4119200110435486, -0.21393999457359314, -0.5122799873352051, -0.3194499909877777, 0.12661999464035034, -0.3151000142097473, 0.0031429000664502382, 0.27129000425338745, 0.1732800006866455, -1.3158999681472778, -0.42414000630378723, -0.6912599802017212, 0.019016999751329422, -0.13375000655651093, -0.0960569977760315, 1.7069000005722046, -0.6529099941253662, -2.6110999584198, 0.26517999172210693, -0.6117799878120422, 2.0950000286102295, 0.38148000836372375, -0.5582299828529358, 0.20360000431537628, -0.3370400071144104, 0.3735400140285492, 0.6951000094413757, -0.0016370000084862113, 0.8188499808311462, 0.5179299712181091, 0.2774600088596344, -0.3717699944972992, -0.43345001339912415, -0.4273200035095215, -0.5491200089454651, -0.3071500062942505, 0.18100999295711517, 0.27090001106262207, -0.2926599979400635, 0.30834001302719116, -1.462399959564209, -0.18998999893665314, 0.9227700233459473, -0.0992169976234436, -0.25165000557899475, 0.4919700026512146, -1.524999976158142, 0.1532599925994873, 0.2827000021934509, 0.12101999670267105, -0.3676599860191345, -0.6127499938011169, -0.18884000182151794, 0.10907000303268433, 0.12314999848604202, 0.09006600081920624, -0.6544700264930725, -0.1725199967622757, 2.633599979162682e-05, 0.25398001074790955, 1.107800006866455, -0.07307399809360504], [-0.18970000743865967, 0.05002399906516075, 0.1908400058746338, -0.04918399825692177, -0.08973699808120728, 0.2100600004196167, -0.5495200157165527, 0.09837699681520462, -0.20135000348091125, 0.34240999817848206, -0.09267699718475342, 0.16099999845027924, -0.1326799988746643, -0.2815999984741211, 0.18737000226974487, -0.42958998680114746, 0.9603899717330933, 0.13971999287605286, -1.0780999660491943, 0.4051800072193146, 0.5053899884223938, -0.5506399869918823, 0.4844000041484833, 0.38043999671936035, -0.0029054998885840178, -0.3494200110435486, -0.09969600290060043, -0.7836800217628479, 1.0362999439239502, -0.2313999980688095, -0.4712100028991699, 0.5712599754333496, -0.2145400047302246, 0.35958001017570496, -0.48319000005722046, 1.087499976158142, 0.2852399945259094, 0.12447000294923782, -0.03924800083041191, -0.07673200219869614, -0.7634299993515015, -0.32409000396728516, -0.5748999714851379, -1.0893000364303589, -0.4181100130081177, 0.451200008392334, 0.12111999839544296, -0.513670027256012, -0.13348999619483948, -1.1377999782562256, -0.2876800000667572, 0.16774000227451324, 0.5580400228500366, 1.538699984550476, 0.018859000876545906, -2.972100019454956, -0.24216000735759735, -0.9249500036239624, 2.199199914932251, 0.28233999013900757, -0.34779998660087585, 0.5162100195884705, -0.43386998772621155, 0.36851999163627625, 0.7457299828529358, 0.07210200279951096, 0.2793099880218506, 0.9256899952888489, -0.050335999578237534, -0.8585600256919861, -0.13580000400543213, -0.9255099892616272, -0.33991000056266785, -1.0393999814987183, -0.06720300018787384, -0.21378999948501587, -0.47690001130104065, 0.21377000212669373, -0.8400800228118896, 0.052535999566316605, 0.5929800271987915, 0.29603999853134155, -0.6764400005340576, 0.13916000723838806, -1.5504000186920166, -0.20765000581741333, 0.7221999764442444, 0.5205600261688232, -0.07622099667787552, -0.1519400030374527, -0.13133999705314636, 0.0586169995367527, -0.3186900019645691, -0.6141899824142456, -0.6239299774169922, -0.41547998785972595, -0.03817500174045563, -0.3980399966239929, 0.4764699935913086, -0.1598300039768219], [-0.4988600015640259, 0.7660199999809265, 0.8975099921226501, -0.7854700088500977, -0.6855000257492065, 0.6260899901390076, -0.3965499997138977, 0.3491300046443939, 0.33333998918533325, -0.45232999324798584, 0.6122300028800964, 0.07594799995422363, 0.22530999779701233, 0.1636500060558319, 0.28095000982284546, -0.24758000671863556, 0.009900899603962898, 0.711080014705658, -0.7585899829864502, 0.8742300271987915, 0.003104100003838539, 0.3579599857330322, -0.3523299992084503, -0.6650000214576721, 0.38446998596191406, 0.62677001953125, -0.5154299736022949, -0.9665300250053406, 0.6151700019836426, -0.7545499801635742, -0.01235899981111288, 1.1188000440597534, 0.35719001293182373, 0.007176899816840887, 0.2025499939918518, 0.5011000037193298, -0.4404599964618683, 0.1066100001335144, 0.793910026550293, -0.8094800114631653, -0.015600999817252159, -0.22888000309467316, -0.3419800102710724, -1.006500005722046, -0.8762999773025513, 0.15164999663829803, -0.0853390023112297, -0.6464999914169312, -0.16732999682426453, -1.4499000310897827, -0.006590500008314848, 0.004811299964785576, -0.012445000000298023, 1.0473999977111816, -0.19381000101566315, -2.599100112915039, 0.4052799940109253, 0.4380300045013428, 1.9332000017166138, 0.45813998579978943, -0.04881900176405907, 1.430799961090088, -0.7863900065422058, -0.20791999995708466, 1.090000033378601, 0.2481600046157837, 1.1486999988555908, 0.5148100256919861, -0.21831999719142914, -0.45719999074935913, 0.13887999951839447, -0.2636899948120117, 0.1364700049161911, -0.6053900122642517, 0.09958600252866745, 0.23343999683856964, 0.1364700049161911, -0.18459999561309814, -0.04773399978876114, -0.1839199960231781, 0.5271900296211243, -0.28850001096725464, -1.0742000341415405, -0.04670000076293945, -1.830199956893921, -0.2119700014591217, 0.02979999966919422, -0.30963999032974243, -0.43386000394821167, -0.3646300137042999, -0.3273800015449524, -0.009342700242996216, 0.4720500111579895, -0.5169100165367126, -0.591759979724884, -0.32343000173568726, 0.20051999390125275, -0.41179001331329346, 0.4053899943828583, 0.785040020942688], [-0.4360800087451935, 0.39103999733924866, 0.516569972038269, -0.13861000537872314, 0.2029000073671341, 0.5072299838066101, -0.012543999589979649, 0.22947999835014343, -0.631600022315979, 0.21198999881744385, -0.018043000251054764, -0.39364001154899597, 0.7416399717330933, 0.3022100031375885, 0.5179200172424316, -0.251910001039505, 0.25372999906539917, -0.6518399715423584, -0.42963001132011414, 0.009362200275063515, 0.023334000259637833, -0.3924500048160553, 0.349480003118515, 0.21217000484466553, 0.7346000075340271, -0.2196200042963028, -0.02861100062727928, -0.34641000628471375, -0.20934000611305237, -0.27090999484062195, -0.17636999487876892, 0.82396000623703, -0.08233900368213654, -0.0348690003156662, 0.07972200214862823, 0.3484100103378296, 0.6088700294494629, 0.22811000049114227, -0.2963300049304962, 0.18633000552654266, 0.23399999737739563, -0.709659993648529, 0.16312000155448914, -0.20857000350952148, 0.09236899763345718, -0.07543499767780304, -0.13905000686645508, -0.35120999813079834, -0.19971999526023865, -0.41686999797821045, -0.31485000252723694, 0.16122999787330627, 0.038881998509168625, 1.6654000282287598, -0.12400999665260315, -3.341900110244751, 0.1092899963259697, -0.02619899995625019, 1.24399995803833, 0.8437399864196777, -0.15679000318050385, 0.7904099822044373, -0.042433001101017, 0.18884000182151794, 0.06434500217437744, -0.1168299987912178, 1.0467000007629395, 0.7181299924850464, 0.5783399939537048, 0.27013999223709106, -0.5090799927711487, -0.08399499952793121, -0.1437000036239624, -0.7640799880027771, 0.27417999505996704, 0.5681399703025818, -0.39375001192092896, -0.32558000087738037, -0.9285399913787842, -0.1309799998998642, 1.3277000188827515, 0.11851000040769577, -0.15550999343395233, 0.5971999764442444, -1.0839999914169312, -0.05813699960708618, 0.23885999619960785, 0.145579993724823, -0.5930299758911133, -0.4751099944114685, -0.22064000368118286, -0.3759100139141083, -0.7964900135993958, 0.013465000316500664, -0.4459500014781952, -0.34623000025749207, -0.7539799809455872, -0.3517000079154968, 0.9945600032806396, 0.08819600194692612], [-0.542639970779419, 0.4147599935531616, 1.0321999788284302, -0.40244001150131226, 0.4669100046157837, 0.2181600034236908, -0.07486400008201599, 0.47332000732421875, 0.08099599927663803, -0.22078999876976013, -0.12807999551296234, -0.1143999993801117, 0.5089100003242493, 0.11568000167608261, 0.028210999444127083, -0.3628000020980835, 0.4382300078868866, 0.04751100018620491, 0.20282000303268433, 0.4985699951648712, -0.10068000108003616, 0.13268999755382538, 0.16971999406814575, 0.11653000116348267, 0.3135499954223633, 0.2571299970149994, 0.09278299659490585, -0.5682600140571594, -0.5297499895095825, -0.05145600065588951, -0.673259973526001, 0.9253299832344055, 0.26930001378059387, 0.2273399978876114, 0.6636499762535095, 0.26221001148223877, 0.19719000160694122, 0.26089999079704285, 0.1877399981021881, -0.34540000557899475, -0.4263499975204468, 0.13975000381469727, 0.5633800029754639, -0.5690699815750122, 0.12398000061511993, -0.12894000113010406, 0.724839985370636, -0.2610499858856201, -0.2631399929523468, -0.4360499978065491, 0.07890799641609192, -0.8414599895477295, 0.5159500241279602, 1.3997000455856323, -0.7645999789237976, -3.1452999114990234, -0.2920199930667877, -0.3124699890613556, 1.5128999948501587, 0.5243499875068665, 0.21456000208854675, 0.42451998591423035, -0.08841100335121155, -0.1780499964952469, 1.187600016593933, 0.10578999668359756, 0.7657099962234497, 0.21913999319076538, 0.358240008354187, -0.11636000126600266, 0.0932610034942627, -0.6248300075531006, -0.21897999942302704, 0.21796000003814697, 0.740559995174408, -0.43735000491142273, 0.14342999458312988, 0.14719000458717346, -1.1605000495910645, -0.05050799995660782, 0.1267700046300888, -0.014395000413060188, -0.9867600202560425, -0.09129700064659119, -1.205399990081787, -0.11974000185728073, 0.047846999019384384, -0.5400099754333496, 0.5245699882507324, -0.709630012512207, -0.32528001070022583, -0.13459999859333038, -0.4131399989128113, 0.33434998989105225, -0.007241200190037489, 0.32253000140190125, -0.0442189984023571, -1.2969000339508057, 0.7621700167655945, 0.46349000930786133], [-0.2376900017261505, 0.5939199924468994, 0.5869699716567993, -0.041788000613451004, -0.8680300116539001, -0.005112200044095516, -0.44929999113082886, -0.027984999120235443, 0.06567399948835373, -0.37900999188423157, 0.31174999475479126, 0.20528000593185425, 0.4309999942779541, -0.3091300129890442, -0.08452299982309341, 0.056901998817920685, 0.34703999757766724, 0.3233200013637543, -0.6041300296783447, 0.2312300056219101, -0.09547600150108337, -0.5000900030136108, 0.024528000503778458, -0.5819000005722046, 0.0075945002026855946, -0.13871000707149506, -0.26416999101638794, -0.7827000021934509, -0.24023999273777008, 0.08182699978351593, -0.1867000013589859, 0.954039990901947, -0.05741199851036072, 0.00897470023483038, -0.2049199938774109, 0.06090199947357178, -0.018264999613165855, 0.33489999175071716, 0.23729999363422394, -0.17605000734329224, -0.5401300191879272, -0.3274500072002411, -0.08896300196647644, -0.3841699957847595, -1.0902999639511108, 0.17027999460697174, -0.019269000738859177, -0.35686999559402466, -0.00847719982266426, -0.8152499794960022, 0.23428000509738922, 0.11118000000715256, 0.4235599935054779, 1.1109999418258667, -0.35534998774528503, -2.3889000415802, 0.6202999949455261, -0.1635199934244156, 1.4450000524520874, 0.583329975605011, -0.2294600009918213, 1.4375, -0.06399700045585632, -0.3151099979877472, 1.087499976158142, 0.3922100067138672, 0.731469988822937, 0.5723599791526794, -0.05078100040555, -0.02773600071668625, 0.41084998846054077, -0.2507599890232086, -0.2633099853992462, -0.386819988489151, 0.5066699981689453, -0.17800000309944153, 0.018333999440073967, -0.6404200196266174, -0.830780029296875, 0.26166999340057373, 0.7190999984741211, 0.15049999952316284, -0.675320029258728, -0.14869999885559082, -2.1266000270843506, -0.5856199860572815, -0.12432999908924103, -0.32622000575065613, -1.0088000297546387, -0.6550599932670593, 0.12711000442504883, 0.22699999809265137, -0.26423001289367676, -0.44032999873161316, -0.45517998933792114, -0.2870199978351593, -0.48124998807907104, -0.5830199718475342, 0.20035000145435333, 0.5030800104141235], [0.30449000000953674, -0.19628000259399414, 0.20225000381469727, -0.6168699860572815, -0.6848400235176086, -0.11886999756097794, 0.08162599802017212, 0.1890600025653839, 0.2243800014257431, 0.03343300148844719, 0.2464900016784668, 0.10935000330209732, 0.05426900088787079, 0.17402000725269318, -0.24223999679088593, -0.17824000120162964, 0.15826000273227692, 0.6320000290870667, -0.8598099946975708, 0.32896000146865845, 0.3327000141143799, -0.06351599842309952, 0.04830700159072876, -0.038986001163721085, -0.15839999914169312, -0.11807999759912491, -0.4840399920940399, -0.8478000164031982, 0.5842700004577637, -0.46182000637054443, 0.20295000076293945, 0.8636299967765808, -0.10948999971151352, 0.3292100131511688, -0.07091499865055084, 0.5900700092315674, -0.02752400003373623, 0.5796999931335449, 0.030799999833106995, -0.038447000086307526, -0.5767999887466431, 0.19497999548912048, -0.12223999947309494, -0.3847000002861023, -0.5111100077629089, -0.23528000712394714, 0.49281999468803406, -0.7940000295639038, 0.08403000235557556, -1.5505000352859497, 0.18490999937057495, 0.26172998547554016, 0.20715999603271484, 0.9164800047874451, -0.0009998000459745526, -2.4516000747680664, -0.24172000586986542, -0.1973000019788742, 1.2654999494552612, 1.0784000158309937, -0.4793800115585327, 0.9546700119972229, -0.4140700101852417, 0.09363599866628647, 1.0537999868392944, -0.09913700073957443, 0.6020100116729736, 0.6995199918746948, -0.5010499954223633, -0.04914600029587746, -0.2343599945306778, -0.4972899854183197, 0.022624000906944275, -0.6935200095176697, 0.008595800027251244, 0.10715000331401825, -0.30272001028060913, 0.038256000727415085, -0.8047800064086914, 0.043407998979091644, 0.51528000831604, -0.3939499855041504, -0.44113999605178833, -0.13670000433921814, -1.7644000053405762, -0.659280002117157, 0.34358999133110046, -0.08892799913883209, -0.29006001353263855, -0.07105199992656708, 0.19438999891281128, -0.6284599900245667, -0.008807200007140636, -0.008593600243330002, -0.6492900252342224, -0.03508500009775162, -0.3790700137615204, -0.1838500052690506, -0.12432000041007996, 0.2746799886226654], [-0.2766300141811371, 0.5509399771690369, 0.13617999851703644, 0.5968300104141235, -0.2486799955368042, -0.34310999512672424, 0.7465999722480774, 0.12717999517917633, -0.28819000720977783, 0.7873499989509583, -0.020772000774741173, -0.48315998911857605, 0.23377999663352966, -0.006495700217783451, 0.33921998739242554, 0.04228200018405914, 0.5447700023651123, 0.6057500243186951, 0.2729400098323822, 0.1301099956035614, -0.04390000179409981, -0.5136399865150452, 0.2554999887943268, 0.3304600119590759, 0.4398300051689148, -0.22454999387264252, 0.0924919992685318, -1.2389999628067017, -0.5824800133705139, 0.29794999957084656, 0.12634000182151794, 1.3108999729156494, -0.22366000711917877, -0.18946999311447144, 0.83992999792099, 0.3865100145339966, 0.4103100001811981, -0.04732900112867355, 0.3379000127315521, -0.43654999136924744, -0.19865000247955322, -0.30695998668670654, 0.12326999753713608, 0.22901000082492828, -0.3421599864959717, 0.19249999523162842, 0.15737000107765198, -0.30820000171661377, -0.39695999026298523, 0.0804629996418953, -0.2800599932670593, 0.08126600086688995, 0.15053999423980713, 1.3842999935150146, 0.39917001128196716, -1.996999979019165, -0.7401099801063538, 0.5926200151443481, 1.090000033378601, -0.11468999832868576, 0.09227199852466583, 0.33024001121520996, -0.6194700002670288, 0.6391299962997437, 1.1857000589370728, -0.04256400093436241, -0.6085799932479858, -0.30320000648498535, 0.16854999959468842, 0.5658599734306335, 0.36660999059677124, 0.12138000130653381, -0.060965001583099365, -0.057785000652074814, 0.47064000368118286, -0.10270000249147415, 1.1243000030517578, -0.026558000594377518, -0.8118600249290466, -0.9424399733543396, -0.0933540016412735, 0.15091000497341156, 0.3440699875354767, -0.24106000363826752, -0.92044997215271, 0.34696999192237854, 0.39647001028060913, -1.1368999481201172, -0.33570000529289246, -0.8407999873161316, 0.16440999507904053, 0.21244999766349792, 0.4046800136566162, -0.3580400049686432, 0.4827899932861328, -0.11033999919891357, -0.8110100030899048, -0.6382099986076355, 1.02839994430542, 0.05395200103521347], [-0.1786399930715561, 0.14916999638080597, 0.5121899843215942, -0.28411999344825745, 0.622409999370575, 0.7786399722099304, -0.006165599916130304, 0.07729700207710266, 0.24987000226974487, 0.09021700173616409, -0.10688000172376633, 0.38486000895500183, -0.09190399944782257, 0.6361500024795532, 0.24128000438213348, -0.22714999318122864, 0.33535999059677124, 0.5080299973487854, -0.27838999032974243, -0.4377799928188324, 0.5711399912834167, 0.5948500037193298, 0.8112099766731262, 0.19438999891281128, 0.256630003452301, -0.01715799979865551, -0.26403000950813293, -0.36531001329421997, 0.07231099903583527, 0.13405999541282654, -0.15922999382019043, 0.4647499918937683, -0.4958600103855133, -0.43665000796318054, -0.07872399687767029, 0.11747000366449356, -0.07224799692630768, 0.17292000353336334, -0.24977000057697296, 0.0006661000079475343, -0.6629899740219116, -0.7917799949645996, -0.49081000685691833, -0.20194999873638153, 0.04145200178027153, 0.523859977722168, -0.3470599949359894, 0.5537300109863281, 0.366100013256073, -0.32576000690460205, -0.43202000856399536, 0.31898000836372375, 0.2129800021648407, 1.3473999500274658, -0.28075000643730164, -3.0515999794006348, -0.1690399944782257, -0.4860300123691559, 2.515399932861328, 0.7063199877738953, 0.08921200037002563, 1.4163000583648682, 0.07221999764442444, 0.5487599968910217, 0.8368099927902222, -0.03195599839091301, 0.3499099910259247, -0.0893929973244667, -0.25960999727249146, 0.0021854001097381115, 0.1941400021314621, -0.5611299872398376, -0.027708999812602997, -0.8605899810791016, -0.14496999979019165, -0.12171000242233276, -0.3909600079059601, -0.25363001227378845, -0.6604400277137756, 0.12262000143527985, 0.7856900095939636, 0.7203099727630615, -0.7325000166893005, 0.4322800040245056, -0.9325399994850159, -0.08838099986314774, -0.10425999760627747, -0.3402700126171112, -0.2887299954891205, -0.41370001435279846, -0.00341370003297925, 0.20758000016212463, -0.9307299852371216, 0.31036999821662903, -0.14008000493049622, -0.44964998960494995, 0.21297000348567963, 0.31481000781059265, 0.5244899988174438, 0.15522000193595886], [-0.5390700101852417, 0.0330980010330677, 0.522849977016449, 0.02669299952685833, 0.6198099851608276, 0.5233399868011475, -0.4087499976158142, -0.03003700077533722, 0.7869700193405151, 0.02926900051534176, 0.20407000184059143, -0.39215999841690063, 0.12381000071763992, -1.2210999727249146, 0.4255099892616272, 0.5518699884414673, 0.3579300045967102, 0.5161299705505371, -0.17931999266147614, 0.3859899938106537, -0.8891900181770325, -0.7418400049209595, -0.08280199766159058, 0.1751299947500229, 0.041756000369787216, -0.6351400017738342, -0.02668900042772293, 0.13021999597549438, -0.16056999564170837, -0.2881700098514557, 0.19059999287128448, 1.7854000329971313, -0.36820000410079956, -0.13809999823570251, 1.188099980354309, 0.23890000581741333, -0.5580000281333923, -0.370279997587204, 0.45427000522613525, -0.3237900137901306, 0.14587000012397766, -0.034053999930620193, 0.2224999964237213, 0.1343899965286255, -0.3584200143814087, 0.39816001057624817, -0.5232999920845032, -0.4845300018787384, 0.4023500084877014, -0.028132999315857887, 0.7289900183677673, 0.46268999576568604, -0.10859999805688858, 0.4695099890232086, 0.2599000036716461, -0.9948199987411499, -0.121629998087883, -0.6089000105857849, 1.9743000268936157, 0.028185000643134117, 0.10136000066995621, 0.17887000739574432, -0.24696999788284302, 0.30357998609542847, 0.8227199912071228, 0.046300001442432404, 0.5272700190544128, -0.9216300249099731, 0.824429988861084, -0.051295001059770584, -0.2712000012397766, 0.3730100095272064, 0.6810700297355652, -0.609499990940094, 0.2059199959039688, 0.16469000279903412, -0.09651400148868561, -0.7263799905776978, 0.00393169978633523, -0.32221999764442444, 0.3208700120449066, -0.3180299997329712, -1.0120999813079834, 0.02379000000655651, -1.7207000255584717, 0.33976998925209045, 0.4677099883556366, -0.36458998918533325, -0.005014500115066767, -0.1497499942779541, -0.17152999341487885, 1.2253999710083008, 0.49077001214027405, -0.5356600284576416, 0.8512899875640869, 0.02709300071001053, -0.017470000311732292, -0.878030002117157, 0.5380899906158447, -0.2962400019168854], [0.27893000841140747, 0.5966799855232239, 0.35398998856544495, 0.5082100033760071, 0.5993300080299377, -0.6973199844360352, 0.3068599998950958, -0.8104900121688843, -0.06704899668693542, -0.7721199989318848, 0.16103999316692352, -0.1360899955034256, -0.11215999722480774, 0.08912800252437592, 0.6496400237083435, 0.3552199900150299, -0.05113400146365166, -0.24369999766349792, -0.1936900019645691, 0.5180699825286865, -0.10275000333786011, -0.5373200178146362, -0.1834699958562851, -0.19436000287532806, -0.40237000584602356, -0.4057599902153015, 0.5110300183296204, 0.31227999925613403, -0.2264699935913086, -0.0446619987487793, -0.4928100109100342, 0.29065001010894775, -0.8430399894714355, -0.25863000750541687, -0.43762001395225525, -0.12488000094890594, -0.29822999238967896, 0.4800199866294861, -0.1385200023651123, -0.37029001116752625, -0.13965000212192535, -0.1521800011396408, -0.3981899917125702, -0.3316799998283386, -1.1122000217437744, 0.5588499903678894, 0.253030002117157, 0.3717299997806549, 0.36566999554634094, -0.012870999984443188, 0.33553001284599304, 0.11136999726295471, 0.29868000745773315, 0.5450599789619446, 0.5998700261116028, -0.09505700320005417, 0.539359986782074, -0.48890000581741333, 0.34654998779296875, -0.32190001010894775, -0.016766000539064407, 1.4074000120162964, -0.015974000096321106, -0.1512099951505661, 0.5562499761581421, -0.60343998670578, 0.06614500284194946, -0.49553000926971436, 0.5609599947929382, -0.3328399956226349, 0.305510014295578, 0.7468000054359436, 0.25769999623298645, -0.8540400266647339, -0.5900400280952454, 0.14579999446868896, -0.13691000640392303, -0.7282099723815918, -0.7725800275802612, -0.21776999533176422, 0.12328000366687775, 0.9433299899101257, -0.020006999373435974, -0.2559199929237366, -0.8746899962425232, -0.21141000092029572, 0.23627999424934387, 0.35710999369621277, -0.6582599878311157, -0.4441399872303009, 0.05733399838209152, 0.3443799912929535, 0.2101600021123886, -0.5556399822235107, -0.06025400012731552, 0.036754999309778214, -0.09667299687862396, -1.246000051498413, -0.02469700016081333, 1.746899962425232], [0.01114100031554699, 0.39847999811172485, -0.11122000217437744, 0.6348599791526794, 1.090000033378601, -0.04566200077533722, -0.48370999097824097, 0.07406199723482132, 0.02513599954545498, -0.17076000571250916, 0.5138199925422668, -0.7031700015068054, -0.07200799882411957, 0.24282999336719513, 0.33204999566078186, -0.8754299879074097, 0.1895499974489212, -0.4869399964809418, 0.04705300182104111, 0.5249900221824646, -0.4958299994468689, -0.14485999941825867, 0.38901999592781067, -0.5956299901008606, -0.6951900124549866, -0.06546200066804886, -0.31207001209259033, -0.1027199998497963, -0.8920699954032898, 0.25268998742103577, -0.1386999934911728, 0.2992599904537201, -0.455130010843277, -0.25815001130104065, 0.49950000643730164, -0.33972999453544617, -0.0940760001540184, 0.31367000937461853, -0.3722899854183197, 0.45030999183654785, 0.02275400049984455, 0.3398999869823456, 0.2195499986410141, 0.14503000676631927, 0.2942599952220917, -0.12872999906539917, 0.06536500155925751, -0.39983001351356506, -0.17754000425338745, -0.617929995059967, 0.002723800018429756, 0.17041000723838806, -0.2968299984931946, 0.9779300093650818, 0.043779999017715454, -1.7594000101089478, 0.9202100038528442, -1.0472999811172485, 1.9641000032424927, -0.15493999421596527, -0.04082699865102768, -0.011497000232338905, -0.1586499959230423, 0.1367799937725067, 0.6083199977874756, -0.2578999996185303, 0.02676899917423725, -0.06124800071120262, 0.5390899777412415, -0.03061000071465969, -0.19444000720977783, -0.32572001218795776, 0.1636500060558319, -0.3412199914455414, 0.7618799805641174, 0.5860599875450134, 0.19628000259399414, 0.3435100018978119, -0.6859400272369385, -0.3980500102043152, 1.0027999877929688, 0.26517000794410706, -0.4572100043296814, -0.04573800042271614, -1.282099962234497, 0.6256800293922424, 0.43744000792503357, 0.4635399878025055, -0.6224200129508972, 0.09541299939155579, 0.10066000372171402, -0.2962400019168854, 0.3932099938392639, -0.8255100250244141, -0.023249000310897827, -0.22015999257564545, -0.07776500284671783, -0.26923999190330505, 0.9847300052642822, 0.5644999742507935], [0.06426200270652771, 0.20034000277519226, -0.5697799921035767, 0.19328999519348145, 1.2417999505996704, -0.46160998940467834, 0.12602999806404114, -0.4137299954891205, -0.6359099745750427, -0.006612599827349186, 0.3031499981880188, -0.5867499709129333, 0.9276400208473206, 0.06458199769258499, 0.11328999698162079, 0.36708998680114746, 0.10938999801874161, -0.1458899974822998, 0.031442999839782715, 0.964680016040802, -0.21496999263763428, 0.07912100106477737, -0.19559000432491302, 0.01083299983292818, -0.07806699723005295, -0.15254999697208405, 0.6391599774360657, -0.09445799887180328, 0.072843998670578, 0.10875000059604645, -0.9829800128936768, -0.03886500000953674, 0.07418700307607651, 0.4372600018978119, -0.12504999339580536, 0.445389986038208, 0.43130001425743103, -0.3410100042819977, -0.6764000058174133, -0.25644999742507935, 0.3128499984741211, 0.47617998719215393, -0.6092000007629395, 0.7280700206756592, -0.1041100025177002, -0.42559999227523804, -0.3636699914932251, 0.039799001067876816, 0.018376000225543976, 0.30724000930786133, -0.5156499743461609, -0.020410999655723572, -0.7368000149726868, -0.1987999975681305, 0.5557799935340881, -0.8364199995994568, -0.16367000341415405, -0.38273000717163086, -0.8287400007247925, 0.5633800029754639, -0.5130000114440918, 1.0534000396728516, 0.3672899901866913, 0.26447999477386475, 0.7224799990653992, -0.5186399817466736, 0.6373000144958496, 0.30331000685691833, 1.2437000274658203, -0.5070499777793884, 0.2595899999141693, 0.5849199891090393, 0.09105399996042252, -0.5204799771308899, -0.30340999364852905, -0.39636000990867615, 0.1880200058221817, -0.26802998781204224, 0.10322000086307526, -0.4374299943447113, 0.3789600133895874, 0.35168999433517456, 1.2416000366210938, 0.19351999461650848, -1.4536999464035034, 0.7075499892234802, -0.009985299780964851, -0.19664999842643738, -0.6094599962234497, -0.3057500123977661, -0.5281199812889099, 0.42423999309539795, -0.7340499758720398, -0.4348999857902527, 0.2958599925041199, 0.33351999521255493, -0.7970899939537048, -0.265529990196228, 0.23928000032901764, 0.20342999696731567], [0.16493000090122223, -0.08063700050115585, 0.284280002117157, -0.16245000064373016, 0.03359200060367584, 0.06843599677085876, -0.3462600111961365, 0.2977299988269806, 0.11971999704837799, -0.6891000270843506, 0.08317200094461441, -0.5789300203323364, -0.04358400031924248, -0.756820023059845, 0.9842900037765503, 0.1290300041437149, -0.9216300249099731, -0.23055000603199005, 0.5425199866294861, 0.2885900139808655, -0.41381001472473145, -0.6905099749565125, -0.7186800241470337, -0.2258400022983551, -0.649150013923645, -0.39969000220298767, 0.2888700067996979, 0.8863499760627747, 0.5144400000572205, -0.2907800078392029, 0.08946900069713593, 0.9405999779701233, 0.013461999595165253, 0.2848699986934662, 0.1064400002360344, -0.22627000510692596, -0.09724599868059158, 0.4214699864387512, -0.227960005402565, -0.7388899922370911, -0.7131800055503845, 0.31103000044822693, -0.4260599911212921, -0.28200000524520874, -0.9648299813270569, -0.22282999753952026, -0.725059986114502, -0.37946000695228577, 0.5096799731254578, -0.6478300094604492, -0.22642000019550323, 0.268449991941452, -0.4094400107860565, 0.04550499841570854, 0.584659993648529, -0.7180200219154358, 0.5318099856376648, -0.47301000356674194, 0.9464399814605713, -0.47890999913215637, 0.13179999589920044, 0.4944800138473511, -0.31068000197410583, 0.5447400212287903, 0.6215199828147888, -0.597029983997345, -0.17015999555587769, -0.6828699707984924, 0.6553300023078918, -0.11224000155925751, -0.10857000201940536, 0.5293899774551392, 0.8993300199508667, -0.97079998254776, 0.08537600189447403, 0.36166998744010925, 0.7351800203323364, -0.4727199971675873, 0.005412799771875143, -0.721019983291626, 0.1485300064086914, -0.10879000276327133, -0.99031001329422, -0.21171000599861145, -1.4495999813079834, 0.5962499976158142, 0.7411900162696838, -0.40768998861312866, -0.8186100125312805, -0.6275299787521362, -0.6015599966049194, 0.49296000599861145, -0.44282999634742737, -0.24844999611377716, 1.1943000555038452, 0.4332500100135803, 0.12008000165224075, -0.49094998836517334, 0.522570013999939, 0.8288599848747253], [-0.2708599865436554, 0.04400600120425224, -0.020260000601410866, -0.17395000159740448, 0.6444000005722046, 0.7121300101280212, 0.35510000586509705, 0.47137999534606934, -0.2963699996471405, 0.5442699790000916, -0.7229400277137756, -0.0047611999325454235, 0.04061099886894226, 0.04323599860072136, 0.29728999733924866, 0.10724999755620956, 0.4015600085258484, -0.536620020866394, 0.03338199853897095, 0.06739600002765656, 0.6455600261688232, -0.08552300184965134, 0.14102999866008759, 0.09453900158405304, 0.7494699954986572, -0.1940000057220459, -0.6873900294303894, -0.4174099862575531, -0.22807000577449799, 0.11999999731779099, -0.4899899959564209, 0.8094499707221985, 0.045138001441955566, -0.11897999793291092, 0.2016099989414215, 0.3927600085735321, -0.20121000707149506, 0.3135400116443634, 0.7530400156974792, 0.2590700089931488, -0.11565999686717987, -0.029318999499082565, 0.9349899888038635, -0.3606700003147125, 0.5242000222206116, 0.23705999553203583, 0.5271499752998352, 0.2286899983882904, -0.5195800065994263, -0.7934899926185608, -0.20367999374866486, -0.5018699765205383, 0.18748000264167786, 0.9428200125694275, -0.4483399987220764, -3.6791999340057373, 0.044183000922203064, -0.26750999689102173, 2.199700117111206, 0.2409999966621399, -0.03342499956488609, 0.6955299973487854, -0.6447200179100037, -0.00722770020365715, 0.8957499861717224, 0.2001499980688095, 0.46492999792099, 0.6193299889564514, -0.10660000145435333, 0.08691000193357468, -0.46230000257492065, 0.18262000381946564, -0.15849000215530396, 0.02079099975526333, 0.19372999668121338, 0.06342600286006927, -0.31672999262809753, -0.48177000880241394, -1.3847999572753906, 0.13669000566005707, 0.9685900211334229, 0.04996500164270401, -0.27379998564720154, -0.03568600118160248, -1.0577000379562378, -0.24467000365257263, 0.903659999370575, -0.12442000210285187, 0.08077599853277206, -0.8340100049972534, 0.5720099806785583, 0.08894500136375427, -0.42531999945640564, -0.01825300045311451, -0.07999499887228012, -0.2858099937438965, 